# NEED: sudo xcodebuild -license accept
ENV["PATH"] = "#{HOMEBREW_PREFIX}/bin:#{ENV["PATH"]}"

## Browser
cask "brave-browser"
cask "google-chrome"
# cask "firefox"
# cask "microsoft-edge"

## Develop
brew "ghq"
brew "peco"
brew "direnv"
brew "mkcert"
brew "proto"
brew "awscli"
brew "firebase-cli"
# brew "openjdk@17"
cask "gcloud-cli"
cask "orbstack"
# cask "visual-studio-code"
# cask "coteditor"
cask "obsidian"
cask "cyberduck"
# cask "apidog"
cask "tableplus"
# cask "gas-mask"
# cask "owasp-zap"
cask "ngrok"
cask "tailscale"
# cask "arduino-ide"

## Web3
# cask "ipfs"
# cask "ipfs-desktop"
cask "ledger-live"
# https://frame.sh/

## AI
cask "cursor"
cask "antigravity"
cask "claude-code"
cask "codex"
cask "comfyui"
brew "ollama"
brew "opencode" # anomalyco/tap/opencode

# https://pinokio.co/

## Creative
cask "adobe-creative-cloud"
# cask "zxpinstaller"
cask "affinity"
cask "blender"
# cask "magicavoxel"
# cask "handbrake"
cask "imageoptim"
cask "vcv-rack"
# cask "upscayl"
# cask "processing"
cask "tiled"
# cask "ableton-live-standard"
# cask "ik-product-manager"
# https://www.live2d.com/
# https://vroid.com/studio

## Media
# brew "ffmpeg"
# cask "obs"
# cask "loopback"
cask "vlc"
cask "spotify"
# https://commentscreen.com
# https://vcamapp.com/
# https://denchisoft.com/

## Enterprise
# cask "microsoft-auto-update"
# cask "microsoft-excel"
# cask "microsoft-powerpoint"
# cask "microsoft-teams"
cask "microsoft-outlook"

## Tools
cask "sitesucker-pro"
cask "pixelsnap"
cask "cleanshot"
cask "1password"
cask "appcleaner"
cask "google-drive"
cask "hiddenbar"
cask "jdownloader"
cask "betterzip"
cask "raycast"
cask "numi"
# cask "aws-vpn-client"
# cask "maccy"
# cask "notion-calendar"
# cask "cheatsheet"
# cask "cooviewer" 
# cask "easyfind"
# cask "ogdesign-eagle"
# cask "onyx"
cask "tunnelbear"
cask "namechanger"

# cask "scroll-reverser"
# cask "resolutionator"

## Driver
# https://nas.ugreen.jp/pages/download-center
# https://www.insta360.com/jp/download/insta360-link
# https://www.logicool.co.jp/ja-jp/software/logi-options-plus.html
# https://www.wakdev.com/en/apps/nfc-tools-pc-mac.html
# https://www.wakdev.com/en/apps/nfc-tools-kbc-pc-mac.html

## Communicate
cask "slack"
cask "zoom"
cask "discord"
cask "chatwork"
# cask "telegram"
# cask "whatsapp"

## Other
cask "steam"

## Font
# cask "font-fontawesome"
# cask "font-roboto"
cask "font-m-plus-2"
cask "font-rounded-mplus"
cask "font-noto-color-emoji"
cask "font-noto-sans-cjk-jp"
cask "font-noto-serif-cjk-jp"
cask "font-udev-gothic"

# https://opentype.jp/woffconv.htm  #WOFFコンバータ
# https://opentype.jp/subsetfontmk.htm  #サブセットフォントメーカー

## MacApp
brew "mas"
mas "colorslurp", id: 1287239339
mas "runcat", id: 1429033973
mas "tunacan-2", id: 1594063111
mas "line", id: 539883307
mas "klack", id: 6446206067
mas "ultimate-focus", id: 1663556775
mas "kindle", id: 302584613
mas "photoresize", id: 492236133
# mas "remote-mouse", id: 403195710
# mas "mirack", id: 1468259834
