tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"

# Browser
cask "google-chrome"
cask "firefox"
cask "brave-browser"
cask "microsoft-edge"

# Business
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-teams"

# Develop
brew "ghq"
brew "peco"
brew "nodebrew"
brew "google-cloud-sdk"
brew "go"
brew "pyenv"
cask "docker"
cask "visual-studio-code"
cask "coteditor"
cask "transmit"
cask "fork"
cask "stoplight-studio"
cask "gas-mask"
cask "owasp-zap"
cask "paw"
cask "tableplus"
cask "sitesucker-pro"
cask "pixelsnap"
cask "cleanshot"
cask "ipfs"
#cask "dash"
#cask "ngrok"
#cask "fastlane"
#cask "mysqlworkbench"

# Creative
cask "adobe-creative-cloud"
cask "affinity-photo"
cask "affinity-designer"
cask "affinity-publisher"
cask "blender"
cask "magicavoxel"
cask "vlc"
cask "handbrake"

# Tools
brew "ffmpeg"
cask "1password"
cask "easyfind"
cask "authy"
cask "rectangle"
cask "resolutionator"
cask "aws-vpn-client"
cask "google-drive"
cask "numi"
cask "betterzip"
cask "appcleaner"
cask "jdownloader"
cask "keka"
cask "maccy"
cask "raycast"
cask "scroll-reverser"
cask "hiddenbar"
cask "ogdesign-eagle"

# Communicate
cask "slack"
cask "zoom"
cask "telegram"
cask "discord"
cask "obs"

# Font
brew "svn"
tap "homebrew/cask-fonts"
cask "font-fontawesome"
cask "font-mplus"
cask "font-rounded-mplus"
cask "font-noto-color-emoji"
cask "font-noto-sans-cjk-jp"
cask "font-noto-serif-cjk-jp"
cask "font-biz-udgothic"
cask "font-biz-udmincho"
cask "font-biz-udpgothic"
cask "font-biz-udpmincho"
cask "font-roboto"
cask "font-udev-gothic"

# MacApp
brew "mas"
mas "Meeter", id: 1510445899