# NEED: sudo xcodebuild -license accept

tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "moonrepo/proto" "https://github.com/moonrepo/proto"

# Browser
cask "brave-browser"
# cask "google-chrome"
# cask "firefox"
# cask "microsoft-edge"

# Develop
brew "ghq"
brew "peco"
brew "proto"
brew "awscli"
brew "google-cloud-sdk"
brew "go"
# brew "pyenv"
brew "git"
brew "orbstack"
# cask "visual-studio-code"
cask "coteditor"
cask "transmit"
cask "fork"
cask "apidog"
cask "paw"
cask "tableplus"
cask "sitesucker-pro"
cask "pixelsnap"
cask "cleanshot"
cask "ipfs"
cask "cursor"

# cask "docker"
# cask "stoplight-studio"
# cask "gas-mask"
# cask "owasp-zap"
# cask "dash"
# cask "ngrok"
# cask "fastlane"
# cask "mysqlworkbench"
# https://frame.sh/

# Creative
cask "adobe-creative-cloud"
cask "affinity-photo"
cask "affinity-designer"
cask "affinity-publisher"
cask "blender"
cask "magicavoxel"
cask "handbrake"
cask "imageoptim"
cask "vcv-rack"
cask "upscayl"
# cask "sketch"

# Media
brew "ffmpeg"
cask "obs"
cask "loopback"
cask "vlc"
cask "spotify"
cask "kindle"

# Document
# cask "microsoft-auto-update"
# cask "microsoft-excel"
# cask "microsoft-powerpoint"
# cask "microsoft-teams"

# Tools
cask "1password"
cask "appcleaner"
cask "authy"
cask "aws-vpn-client"
cask "betterzip"
cask "cheatsheet"
cask "cleanshot"
cask "cooviewer" 
cask "easyfind"
cask "google-drive"
cask "hiddenbar"
cask "jdownloader"
cask "keka"
cask "maccy"
cask "notion-calendar"
cask "numi"
cask "ogdesign-eagle"
cask "onyx"
cask "pixelsnap"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "raycast"
cask "rectangle"
cask "scroll-reverser"

# cask "resolutionator"
# cask "quicklook-csv"

# Communicate
cask "slack"
cask "zoom"
cask "telegram"
cask "discord"

# Font
# brew "svn"
tap "homebrew/cask-fonts"
cask "font-fontawesome"
cask "font-mplus"
cask "font-mplus-nerd-font"
cask "font-rounded-mplus"
cask "font-noto-color-emoji"
cask "font-noto-sans-cjk-jp"
cask "font-noto-serif-cjk-jp"
cask "font-biz-udgothic"
cask "font-biz-udmincho"
cask "font-biz-udpgothic"
cask "font-biz-udpmincho"
cask "font-roboto"
cask "font-udev-gothic"
cask "font-udev-gothic-nf"
cask "font-0xproto-nerd-font"
cask "font-m+"

# MacApp
brew "mas"
mas "colorslurp", id: 1287239339
mas "runcat", id: 1429033973
mas "tunacan-2", id: 1594063111